# DATAFRAME manipulation

In [1]:
# Install package
install.packages('dplyr')

# load library
library("dplyr")

# to load datasets use:
library('datasets')

Updating HTML index of packages in '.Library'

Making 'packages.html' ...
 done


Attaching package: ‘dplyr’


The following objects are masked from ‘package:stats’:

    filter, lag


The following objects are masked from ‘package:base’:

    intersect, setdiff, setequal, union

In [2]:
#To load iris dataset
data(iris)
summary(iris)
str(iris)

  Sepal.Length    Sepal.Width     Petal.Length    Petal.Width
 Min.   :4.300   Min.   :2.000   Min.   :1.000   Min.   :0.100
 1st Qu.:5.100   1st Qu.:2.800   1st Qu.:1.600   1st Qu.:0.300
 Median :5.800   Median :3.000   Median :4.350   Median :1.300
 Mean   :5.843   Mean   :3.057   Mean   :3.758   Mean   :1.199
 3rd Qu.:6.400   3rd Qu.:3.300   3rd Qu.:5.100   3rd Qu.:1.800
 Max.   :7.900   Max.   :4.400   Max.   :6.900   Max.   :2.500
       Species
 setosa    :50
 versicolor:50
 virginica :50

'data.frame':	150 obs. of  5 variables:
 $ Sepal.Length: num  5.1 4.9 4.7 4.6 5 5.4 4.6 5 4.4 4.9 ...
 $ Sepal.Width : num  3.5 3 3.2 3.1 3.6 3.9 3.4 3.4 2.9 3.1 ...
 $ Petal.Length: num  1.4 1.4 1.3 1.5 1.4 1.7 1.4 1.5 1.4 1.5 ...
 $ Petal.Width : num  0.2 0.2 0.2 0.2 0.2 0.4 0.3 0.2 0.2 0.1 ...
 $ Species     : Factor w/ 3 levels "setosa","versicolor",..: 1 1 1 1 1 1 1 1 1 1 ...

### dplyr package important functions

1. select() - *select columns (variables)*
2. filter() - *(subset) rows*
3. mutate() - *create new variables*
4. summarise() - *summarize (or aggregate) data*
5. select_if() - *condition selection*
6. arrange() - *sort data*
7. group_by() - *group data*
8. join() - *join data frames*

### Select

Selection can be made by several ways, using column names or vector with numbers of the columns. Or even negative selection can be made by using select(dataset, -column)

In [3]:
selected <- select(iris, Sepal.Length, Sepal.Width, Petal.Length)
head(selected, 3)

  Sepal.Length Sepal.Width Petal.Length
1 5.1          3.5         1.4
2 4.9          3.0         1.4
3 4.7          3.2         1.3

In [4]:
selected <- select(iris, Sepal.Length:Petal.Length)
head(selected, 3)

  Sepal.Length Sepal.Width Petal.Length
1 5.1          3.5         1.4
2 4.9          3.0         1.4
3 4.7          3.2         1.3

In [5]:
selected <- select(iris,c(1:3))
head(selected, 3)

  Sepal.Length Sepal.Width Petal.Length
1 5.1          3.5         1.4
2 4.9          3.0         1.4
3 4.7          3.2         1.3

In [6]:
selected <- select(iris, -Sepal.Length, -Sepal.Width)
head(selected, 3)

  Petal.Length Petal.Width Species
1 1.4          0.2         setosa
2 1.4          0.2         setosa
3 1.3          0.2         setosa

### Filter

Function used to match the rows using given criteria.

In [7]:
filtered <- filter(iris, Species == "setosa", Sepal.Width > 3)
print(paste(c('dimensions of the filtered data: ', dim(filtered)), collapse = " "))
print(head(selected, 3))

[1] "dimensions of the filtered data:  42 5"
  Petal.Length Petal.Width Species
1          1.4         0.2  setosa
2          1.4         0.2  setosa
3          1.3         0.2  setosa

### Mutate

Creates new columns, while preserving existing columns in a dataset.

In [8]:
# let's create a new column with logical values
mutated <- mutate(iris, new.column = Sepal.Width > 3)
head(mutated)

  Sepal.Length Sepal.Width Petal.Length Petal.Width Species new.column
1 5.1          3.5         1.4          0.2         setosa   TRUE
2 4.9          3.0         1.4          0.2         setosa  FALSE
3 4.7          3.2         1.3          0.2         setosa   TRUE
4 4.6          3.1         1.5          0.2         setosa   TRUE
5 5.0          3.6         1.4          0.2         setosa   TRUE
6 5.4          3.9         1.7          0.4         setosa   TRUE

In [9]:
table(mutated$new.column)

FALSE  TRUE
   83    67

### Arrange

Sorts rows by given variables

In [10]:
arranged <- arrange(iris, Sepal.Length)
head(arranged)
arranged <- arrange(iris, desc(Sepal.Length))
head(arranged)

  Sepal.Length Sepal.Width Petal.Length Petal.Width Species
1 4.3          3.0         1.1          0.1         setosa
2 4.4          2.9         1.4          0.2         setosa
3 4.4          3.0         1.3          0.2         setosa
4 4.4          3.2         1.3          0.2         setosa
5 4.5          2.3         1.3          0.3         setosa
6 4.6          3.1         1.5          0.2         setosa

  Sepal.Length Sepal.Width Petal.Length Petal.Width Species
1 7.9          3.8         6.4          2.0         virginica
2 7.7          3.8         6.7          2.2         virginica
3 7.7          2.6         6.9          2.3         virginica
4 7.7          2.8         6.7          2.0         virginica
5 7.7          3.0         6.1          2.3         virginica
6 7.6          3.0         6.6          2.1         virginica

### Summarize

Basic statistical description, mean, median, mode of a dataset.

In [11]:
summarised <- summarise(iris, Mean.Length = mean(Sepal.Length), Mean.Width = mean(Sepal.Width))
head(summarised)

  Mean.Length Mean.Width
1 5.843333    3.057333

### Select if

In [12]:
selected <- select_if(iris, function(col) is.numeric(col) && mean(col) > 3.5)
head(selected)

  Sepal.Length Petal.Length
1 5.1          1.4
2 4.9          1.4
3 4.7          1.3
4 4.6          1.5
5 5.0          1.4
6 5.4          1.7

### Group by

Used for grouping data within a dataset by one or more variables.

In [13]:
grouped <- group_by(iris, Species)
head(grouped)

  Sepal.Length Sepal.Width Petal.Length Petal.Width Species
1 5.1          3.5         1.4          0.2         setosa
2 4.9          3.0         1.4          0.2         setosa
3 4.7          3.2         1.3          0.2         setosa
4 4.6          3.1         1.5          0.2         setosa
5 5.0          3.6         1.4          0.2         setosa
6 5.4          3.9         1.7          0.4         setosa

In [15]:
# exercise: create a table with mean of the Sepal.Width for each of the species

  Species    Mean.Sepal.Width
1 setosa     3.428
2 versicolor 2.770
3 virginica  2.974

In [ ]:
# Solution
summarize_by_species <- summarise(grouped, Mean.Sepal.Width = mean(Sepal.Width))
summarize_by_species

In [14]:
# pipe operator in R
# Multiple functions can be wrapped together using special notation: %>%
piped <- iris %>% filter(Species == 'setosa', Sepal.Width > 3.0)
head(piped)

  Sepal.Length Sepal.Width Petal.Length Petal.Width Species
1 5.1          3.5         1.4          0.2         setosa
2 4.7          3.2         1.3          0.2         setosa
3 4.6          3.1         1.5          0.2         setosa
4 5.0          3.6         1.4          0.2         setosa
5 5.4          3.9         1.7          0.4         setosa
6 4.6          3.4         1.4          0.3         setosa

In [16]:
# Exercise: Find mean Sepal Length by Species, using pipe operator

  Species    Mean.Length
1 setosa     5.006
2 versicolor 5.936
3 virginica  6.588

In [ ]:
# solution
iris  %>% group_by(Species) %>% summarise(Mean.Length = mean(Sepal.Length))

### Join

Function used for merging dataframes into one. There are several possibilities how dataframes can be joined: 
- inner_join
- left_join
- right_join
- full_join
- semi_join
- anti_join
- join Multiple Data Frames
- join by Multiple Columns

In [17]:
A <- data.frame(index = 1:2,                      
                col_01 = c('a', 'b'),
                stringsAsFactors = FALSE)
B <- data.frame(index = 2:3,                      
                col_02 = c('c', 'd'),
                stringsAsFactors = FALSE)
A
B

  index col_01
1 1     a
2 2     b

  index col_02
1 2     c
2 3     d

In [18]:
# includes all matching rows in A and B
inner_join(A, B, by = 'index')

  index col_01 col_02
1 2     b      c

In [19]:
# includes all matching rows in A
left_join(A, B, by = 'index')

  index col_01 col_02
1 1     a      NA
2 2     b      c

In [20]:
# includes all matching rows in B
right_join(A, B, by = 'index')

  index col_01 col_02
1 2     b      c
2 3     NA     d

In [21]:
# includes all matching rows in A or B
full_join(A, B, by = 'index')

  index col_01 col_02
1 1     a      NA
2 2     b      c
3 3     NA     d

In [22]:
# filtering join, keeps data from the left data table A and uses B - right data table as filter
semi_join(A, B, by = 'index')

  index col_01
1 2     b

In [23]:
# anti_join is the opposite of semi_join
anti_join(A, B, by = 'index')

  index col_01
1 1     a

In [24]:
# Join multiple dataframes
C <- data.frame(index = c(2, 4),                  
                col_02 = c('c', 'd'),
                col_03 = c('e', 'f'),
                 stringsAsFactors = FALSE)
C

  index col_02 col_03
1 2     c      e
2 4     d      f

In [25]:
# Data will get duplicated, since there are same columns in dataframe B and C
full_join(A, B, by = 'index') %>% full_join(., C, by = 'index')

  index col_01 col_02.x col_02.y col_03
1 1     a      NA       NA       NA
2 2     b      c        c        e
3 3     NA     d        NA       NA
4 4     NA     NA       d        f

In [26]:
# Using joining by multiple column can be solution to above problem
full_join(B, C, by = c('index', 'col_02'))

  index col_02 col_03
1 2     c      e
2 3     d      NA
3 4     d      f

In [27]:
B
C

  index col_02
1 2     c
2 3     d

  index col_02 col_03
1 2     c      e
2 4     d      f

In [28]:
# If you don't need the column that you use as a matching criterion, you may get rid of it right away
full_join(B, C, by = c('index', 'col_02')) %>% select(-'index')

  col_02 col_03
1 c      e
2 d      NA
3 d      f

## Reading the data from local disk or URL

In [29]:
# Let's get a dataset: https://archive.ics.uci.edu/ml/datasets/Bank+Marketing
# there are several files in the zip, we will use bank-full.csv
# We can use data.table package: https://cran.r-project.org/web/packages/data.table/index.html
install.packages('data.table')

Updating HTML index of packages in '.Library'

Making 'packages.html' ...
 done

In [30]:
# create new folder
mkdir <- function(folder){
    if (file.exists(folder)) {

         cat("The folder already exists")

        } else {

         dir.create(folder)

    }}

In [31]:
library(data.table)
temp <- tempfile()
download.file('https://archive.ics.uci.edu/ml/machine-learning-databases/00222/bank.zip', temp)
data <- fread(unzip(temp, files = "bank-full.csv"))
rm(temp)

head(data)
mkdir('data')
write.csv(data,'./data/bank-full.csv', row.names = FALSE)

Attaching package: ‘data.table’


The following objects are masked from ‘package:dplyr’:

    between, first, last

  age job          marital education default balance housing loan contact day
1 58  management   married tertiary  no      2143    yes     no   unknown 5
2 44  technician   single  secondary no        29    yes     no   unknown 5
3 33  entrepreneur married secondary no         2    yes     yes  unknown 5
4 47  blue-collar  married unknown   no      1506    yes     no   unknown 5
5 33  unknown      single  unknown   no         1    no      no   unknown 5
6 35  management   married tertiary  no       231    yes     no   unknown 5
  month duration campaign pdays previous poutcome y
1 may   261      1        -1    0        unknown  no
2 may   151      1        -1    0        unknown  no
3 may    76      1        -1    0        unknown  no
4 may    92      1        -1    0        unknown  no
5 may   198      1        -1    0        unknown  no
6 may   139      1        -1    0        unknown  no

The folder already exists

In [32]:
data <- read.csv('./data/bank-full.csv')
head(data)

  age job          marital education default balance housing loan contact day
1 58  management   married tertiary  no      2143    yes     no   unknown 5
2 44  technician   single  secondary no        29    yes     no   unknown 5
3 33  entrepreneur married secondary no         2    yes     yes  unknown 5
4 47  blue-collar  married unknown   no      1506    yes     no   unknown 5
5 33  unknown      single  unknown   no         1    no      no   unknown 5
6 35  management   married tertiary  no       231    yes     no   unknown 5
  month duration campaign pdays previous poutcome y
1 may   261      1        -1    0        unknown  no
2 may   151      1        -1    0        unknown  no
3 may    76      1        -1    0        unknown  no
4 may    92      1        -1    0        unknown  no
5 may   198      1        -1    0        unknown  no
6 may   139      1        -1    0        unknown  no

### Apply functions

Helps to work with data in batches.
- apply()
- lapply()
- sapply()
- tapply()

### Apply
apply(x, margin, function, ...)<br>
margin - A vector giving the subscripts which the function will be applied over.
- 1 indicates rows
- 2 indicates columns
- c(1, 2) indicates rows and columns
<br>function - The function that will be applied over data

In [33]:
data_ints <- select_if(data, function(col) is.numeric(col))
data.frame(apply(data_ints, 2, mean))

         apply.data_ints..2..mean.
age        40.9362102
balance  1362.2720577
day        15.8064188
duration  258.1630798
campaign    2.7638407
pdays      40.1978280
previous    0.5803234

In [34]:
# user defined founction can be also used
squared <- apply(data_ints, 2, function(x){x^2})
head(squared)

connect <- function(x) {
    paste(x, collapse = '-')
}

connected <- apply(data, 1, connect)
connected[1:5]

     age  balance day duration campaign pdays previous
[1,] 3364 4592449 25  68121    1        1     0
[2,] 1936     841 25  22801    1        1     0
[3,] 1089       4 25   5776    1        1     0
[4,] 2209 2268036 25   8464    1        1     0
[5,] 1089       1 25  39204    1        1     0
[6,] 1225   53361 25  19321    1        1     0

[1] "58-management-married-tertiary-no-  2143-yes-no-unknown- 5-may- 261- 1- -1-  0-unknown-no"
[2] "44-technician-single-secondary-no-    29-yes-no-unknown- 5-may- 151- 1- -1-  0-unknown-no"
[3] "33-entrepreneur-married-secondary-no-     2-yes-yes-unknown- 5-may-  76- 1- -1-  0-unknown-no"
[4] "47-blue-collar-married-unknown-no-  1506-yes-no-unknown- 5-may-  92- 1- -1-  0-unknown-no"
[5] "33-unknown-single-unknown-no-     1-no-no-unknown- 5-may- 198- 1- -1-  0-unknown-no"

### lapply
Applies a function to each element of the list.<br>
lapply(data, function, ...)
- data are presented as a list
- function used over each element of the list

In [35]:
data_list <- list(data$day,  data$age)
class(data_list)
result <- lapply(data_list, sum)
result
class(result)

[1] "list"

[[1]]
[1] 714624

[[2]]
[1] 1850767

[1] "list"

### sapply
Very similar to lapply, returns a vector or matrix instead of a list
sapply(data, function)<br>
- data: a list
- function to be applied

In [36]:
result <- sapply(data_list, sum)
result
class(result)

[1]  714624 1850767

[1] "integer"

### tapply
This function breaks the dataset into groups and applies function to created groups.<br>
tapply(data, index, function, ..., simplify)
- data:	A vector
- INDEX: A grouping factor or a list of factors
- function: The function to be applied
- simplify: Optional, returns simplified result if set to TRUE. Default is TRUE.

In [37]:
tapply(data$balance, data$marital, min)
tapply(data$balance, data$marital, max)
tapply(data$balance, data$marital, mean)

divorced  married   single
   -4057    -6847    -8019

divorced  married   single
   66721    98417   102127

divorced  married   single
1178.872 1425.926 1301.498

### More aggregating functions
- by()
- split()
- aggregate()

### by
By function applies a function to a subset of a dataframe.<br>
by(data, f, function)
- data: dataframe, matrix
- f: a factor or a list of factors
- function: function to be applied to the subsets

In [38]:
aggregated <- by(data$age, list(data$marital), mean)
class(aggregated)
aggregated

[1] "by"

: divorced
[1] 45.78298
------------------------------------------------------------
: married
[1] 43.4081
------------------------------------------------------------
: single
[1] 33.70344

In [39]:
aggregated <- by(data$age, list(data$marital, data$housing), mean)
aggregated

: divorced
: no
[1] 48.65565
------------------------------------------------------------
: married
: no
[1] 46.8077
------------------------------------------------------------
: single
: no
[1] 33.57677
------------------------------------------------------------
: divorced
: yes
[1] 43.51015
------------------------------------------------------------
: married
: yes
[1] 40.76914
------------------------------------------------------------
: single
: yes
[1] 33.8115

### split
split(data, f,..)<br>
- data: vector or dataframe
- f: groups of calss factor, vector or list

In [40]:
splitted <- split(data, data$marital)

In [41]:
class(splitted)
length(splitted)
class(splitted[1])
class(splitted[[1]])

[1] "list"

[1] 3

[1] "list"

[1] "data.frame"

In [42]:
head(splitted[[1]], 3)

   age job          marital  education default balance housing loan contact day
8  42  entrepreneur divorced tertiary  yes       2     yes     no   unknown 5
11 41  admin.       divorced secondary no      270     yes     no   unknown 5
36 57  technician   divorced secondary no       63     yes     no   unknown 5
   month duration campaign pdays previous poutcome y
8  may   380      1        -1    0        unknown  no
11 may   222      1        -1    0        unknown  no
36 may   242      1        -1    0        unknown  no

In [43]:
head(splitted[[2]], 3)

  age job          marital education default balance housing loan contact day
1 58  management   married tertiary  no      2143    yes     no   unknown 5
3 33  entrepreneur married secondary no         2    yes     yes  unknown 5
4 47  blue-collar  married unknown   no      1506    yes     no   unknown 5
  month duration campaign pdays previous poutcome y
1 may   261      1        -1    0        unknown  no
3 may    76      1        -1    0        unknown  no
4 may    92      1        -1    0        unknown  no

In [44]:
head(splitted[[3]], 3)

  age job        marital education default balance housing loan contact day
2 44  technician single  secondary no       29     yes     no   unknown 5
5 33  unknown    single  unknown   no        1     no      no   unknown 5
7 28  management single  tertiary  no      447     yes     yes  unknown 5
  month duration campaign pdays previous poutcome y
2 may   151      1        -1    0        unknown  no
5 may   198      1        -1    0        unknown  no
7 may   217      1        -1    0        unknown  no

### Aggregate
Function used to get summary statistics of the data by group.
aggregate(data, f, function)<br>
- data: column of the dataframe to be aggregated
- f: factor to be used for grouping
- function: to be used over the groups

In [45]:
aggregated <- aggregate(data$balance, list(data$job), sum)
class(aggregated)
aggregated

[1] "data.frame"

   Group.1       x
1  admin.         5873423
2  blue-collar   10499141
3  entrepreneur   2262426
4  housemaid      1726570
5  management    16680288
6  retired        4492263
7  self-employed  2602146
8  services       4141904
9  student        1302001
10 technician     9516246
11 unemployed     1982835
12 unknown         510439

### Functions Map, Reduce, Filter and lambda
These functions are quite usefull and commonly used in functional programming.

### Map
https://www.rdocumentation.org/packages/purrr/versions/0.2.5/topics/map<br>
Allows mapping from one vector to another. Map function can be specified using lambda.<br>
Map(function, data)<br>
- function: to use on the data
- data: a list or a vector

In [55]:
vec <- 1:10
res <- Map({function (a) a*2}, vec)
unlist(res)

 [1]  2  4  6  8 10 12 14 16 18 20

### Reduce
Applies the function on a list or vectors one by one. Outpu is a single value<br>
Reduce(f, data)<br>
- f: two argument function
- data: a list or a vector

In [56]:
# when passing lambda to these functions curly brackets can be ommited
vec <- seq(0, 500, 30)
print(x)
res <- Reduce(function (x, y) x+y, vec)
res

 [1]   0  30  60  90 120 150 180 210 240 270 300 330 360 390 420 450 480

[1] 4080

### Filter
Used to remove all elements that does not satisfy given condition<br>
Filter(f, data)<br>
- f: function to be used for condition
- data: a list or a vector

In [59]:
Filter(function (x)x%%60==0, vec)

[1]   0  60 120 180 240 300 360 420 480